src/main/resources/registration.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:tns="http://facturacion.finkok.com/registration" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:senc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s0="apps.services.soap.core.views" xmlns:s12env="http://www.w3.org/2003/05/soap-envelope/" xmlns:s12enc="http://www.w3.org/2003/05/soap-encoding/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" targetNamespace="http://facturacion.finkok.com/registration" name="Application"><wsdl:types><xs:schema targetNamespace="apps.services.soap.core.views" elementFormDefault="qualified"><xs:complexType name="AssingResult"><xs:sequence><xs:element name="success" type="xs:boolean" minOccurs="0" nillable="true"/><xs:element name="credit" type="xs:integer" minOccurs="0" nillable="true"/><xs:element name="message" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="RegistrationListResult"><xs:sequence><xs:element name="message" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="users" type="s0:ResellerUserArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="ResellerUserArray"><xs:sequence><xs:element name="ResellerUser" type="s0:ResellerUser" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="ResellerUser"><xs:sequence><xs:element name="status" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="counter" type="xs:integer" minOccurs="0" nillable="true"/><xs:element name="taxpayer_id" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="credit" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="RegistrationResult"><xs:sequence><xs:element name="message" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="success" type="xs:boolean" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="RegistrationResult" type="s0:RegistrationResult"/><xs:element name="ResellerUser" type="s0:ResellerUser"/><xs:element name="ResellerUserArray" type="s0:ResellerUserArray"/><xs:element name="RegistrationListResult" type="s0:RegistrationListResult"/><xs:element name="AssingResult" type="s0:AssingResult"/></xs:schema><xs:schema targetNamespace="http://facturacion.finkok.com/registration" elementFormDefault="qualified"><xs:import namespace="apps.services.soap.core.views"/><xs:complexType name="editResponse"><xs:sequence><xs:element name="editResult" type="s0:RegistrationResult" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="edit"><xs:sequence><xs:element name="reseller_username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="reseller_password" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="taxpayer_id" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="status" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="cer" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="key" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="passphrase" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="assign"><xs:sequence><xs:element name="username" type="xs:string"/><xs:element name="password" type="xs:string"/><xs:element name="taxpayer_id" type="xs:string"/><xs:element name="credit" type="tns:assign_creditType" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="get"><xs:sequence><xs:element name="reseller_username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="reseller_password" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="taxpayer_id" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="add"><xs:sequence><xs:element name="reseller_username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="reseller_password" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="taxpayer_id" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="type_user" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="coupon" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="added" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="cer" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="key" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="passphrase" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="assignResponse"><xs:sequence><xs:element name="assignResult" type="s0:AssingResult" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="getResponse"><xs:sequence><xs:element name="getResult" type="s0:RegistrationListResult" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:simpleType name="assign_creditType"><xs:restriction base="xs:nonNegativeInteger"><xs:minExclusive value="0"/></xs:restriction></xs:simpleType><xs:complexType name="addResponse"><xs:sequence><xs:element name="addResult" type="s0:RegistrationResult" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="addResponse" type="tns:addResponse"/><xs:element name="getResponse" type="tns:getResponse"/><xs:element name="assignResponse" type="tns:assignResponse"/><xs:element name="add" type="tns:add"/><xs:element name="get" type="tns:get"/><xs:element name="assign" type="tns:assign"/><xs:element name="edit" type="tns:edit"/><xs:element name="editResponse" type="tns:editResponse"/></xs:schema></wsdl:types><wsdl:message name="edit"><wsdl:part name="edit" element="tns:edit"/></wsdl:message><wsdl:message name="editResponse"><wsdl:part name="editResponse" element="tns:editResponse"/></wsdl:message><wsdl:message name="add"><wsdl:part name="add" element="tns:add"/></wsdl:message><wsdl:message name="addResponse"><wsdl:part name="addResponse" element="tns:addResponse"/></wsdl:message><wsdl:message name="assign"><wsdl:part name="assign" element="tns:assign"/></wsdl:message><wsdl:message name="assignResponse"><wsdl:part name="assignResponse" element="tns:assignResponse"/></wsdl:message><wsdl:message name="get"><wsdl:part name="get" element="tns:get"/></wsdl:message><wsdl:message name="getResponse"><wsdl:part name="getResponse" element="tns:getResponse"/></wsdl:message><wsdl:portType name="Application"><wsdl:operation name="edit" parameterOrder="edit"><wsdl:documentation>This function is in charge of editing an account, it will only be used by the resellers</wsdl:documentation><wsdl:input name="edit" message="tns:edit"/><wsdl:output name="editResponse" message="tns:editResponse"/></wsdl:operation><wsdl:operation name="add" parameterOrder="add"><wsdl:documentation>This function is in charge of adding a new user under the reseller, it will only be used by the resellers</wsdl:documentation><wsdl:input name="add" message="tns:add"/><wsdl:output name="addResponse" message="tns:addResponse"/></wsdl:operation><wsdl:operation name="assign" parameterOrder="assign"><wsdl:documentation>This function added credit to Reselleruser</wsdl:documentation><wsdl:input name="assign" message="tns:assign"/><wsdl:output name="assignResponse" message="tns:assignResponse"/></wsdl:operation><wsdl:operation name="get" parameterOrder="get"><wsdl:documentation>This function lists all the user of the account if no taxpayer_id is passed otherwise will return the taxpayer_id and status of the given user.</wsdl:documentation><wsdl:input name="get" message="tns:get"/><wsdl:output name="getResponse" message="tns:getResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="Application" type="tns:Application"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="edit"><soap:operation soapAction="edit" style="document"/><wsdl:input name="edit"><soap:body use="literal"/></wsdl:input><wsdl:output name="editResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="add"><soap:operation soapAction="add" style="document"/><wsdl:input name="add"><soap:body use="literal"/></wsdl:input><wsdl:output name="addResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="assign"><soap:operation soapAction="assign" style="document"/><wsdl:input name="assign"><soap:body use="literal"/></wsdl:input><wsdl:output name="assignResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="get"><soap:operation soapAction="get" style="document"/><wsdl:input name="get"><soap:body use="literal"/></wsdl:input><wsdl:output name="getResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="RegistrationSOAP"><wsdl:port name="Application" binding="tns:Application"><soap:address location="https://facturacion.finkok.com/servicios/soap/registration"/></wsdl:port></wsdl:service></wsdl:definitions>